
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>OpenShift ユーザエクスペリエンス · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../04_Application_Deployment/chap-4.html" />
    
    
    <link rel="prev" href="../../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    イントロダクション
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="chap-3.html">
            
                <a href="chap-3.html">
            
                    
                    OpenShift ユーザエクスペリエンス
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../04_Application_Deployment/chap-4.html">
            
                <a href="../04_Application_Deployment/chap-4.html">
            
                    
                    アプリケーションデプロイメント (s2i,Tekton)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >OpenShift ユーザエクスペリエンス</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6F14;&#x7FD2;1-openshift-&#x30E6;&#x30FC;&#x30B6;&#x30A8;&#x30AF;&#x30B9;&#x30DA;&#x30EA;&#x30A8;&#x30F3;&#x30B9;">&#x6F14;&#x7FD2;1. OpenShift &#x30E6;&#x30FC;&#x30B6;&#x30A8;&#x30AF;&#x30B9;&#x30DA;&#x30EA;&#x30A8;&#x30F3;&#x30B9;</h1>
<h2 id="&#x30B7;&#x30CA;&#x30EA;&#x30AA;">&#x30B7;&#x30CA;&#x30EA;&#x30AA;</h2>
<p>&#x3053;&#x306E;&#x30E9;&#x30DC;&#x3067;&#x306F;&#x3001;Red Hat OpenShift Container Platform&#x3067;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3059;&#x308B;&#x30C7;&#x30E2;&#x3092;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002; </p>
<h3 id="&#x76EE;&#x6A19;">&#x76EE;&#x6A19;</h3>
<ul>
<li>Web &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;(Developer&#x3068;Administrator)&#x3092;&#x7406;&#x89E3;&#x3059;&#x308B;&#x3002;</li>
<li>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4F5C;&#x6210;</li>
<li>Git&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x304B;&#x3089;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3066;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3059;&#x308B;</li>
<li>&#x30A6;&#x30A7;&#x30D6;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x30C8;&#x30DD;&#x30ED;&#x30B8;&#x30FC;&#x30D3;&#x30E5;&#x30FC;&#x306B;&#x6163;&#x308C;&#x308B;</li>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x5316;&#x306E;&#x4E00;&#x90E8;&#x3068;&#x3057;&#x3066;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x3092;&#x95A2;&#x9023;&#x4ED8;&#x3051;&#x308B;</li>
<li>&#x914D;&#x7F6E;&#x3055;&#x308C;&#x305F;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x7BA1;&#x7406;&#x8005;&#x30D3;&#x30E5;&#x30FC;&#x3092;&#x7406;&#x89E3;&#x3059;&#x308B;</li>
</ul>
<hr>
<h2 id="developer-&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;">Developer &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;</h2>
<p>OpenShift Container Platform&#x306E;Web&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x306F;&#x3001;Administrator &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x3068;Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306E;2&#x3064;&#x306E;&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x3067;&#x306F;&#x3001;&#x958B;&#x767A;&#x8005;&#x306E;&#x30E6;&#x30FC;&#x30B9;&#x30B1;&#x30FC;&#x30B9;&#x306B;&#x7279;&#x5316;&#x3057;&#x305F;&#x30EF;&#x30FC;&#x30AF;&#x30D5;&#x30ED;&#x30FC;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ol>
<li>Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306B;&#x5207;&#x308A;&#x66FF;&#x3048;&#x307E;&#x3059;&#x3002; &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x6301;&#x3064;Topology&#x30D3;&#x30E5;&#x30FC;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_developer_perspective.png" alt="Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;"></p>
<div style="text-align: center;"></div>

<hr>
<h2 id="project-&#x4F5C;&#x6210;">Project &#x4F5C;&#x6210;</h2>
<p>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x3042;&#x308B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x30B3;&#x30DF;&#x30E5;&#x30CB;&#x30C6;&#x30A3;&#x304C;&#x4ED6;&#x306E;&#x30B3;&#x30DF;&#x30E5;&#x30CB;&#x30C6;&#x30A3;&#x304B;&#x3089;&#x5207;&#x308A;&#x96E2;&#x3055;&#x308C;&#x305F;&#x72B6;&#x614B;&#x3067;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;&#x3092;&#x6574;&#x7406;&#x30FB;&#x7BA1;&#x7406;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F;Kubernetes&#x30CD;&#x30FC;&#x30E0;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x306B;&#x5BFE;&#x3059;&#x308B;OpenShift&#x306E;&#x62E1;&#x5F35;&#x3067;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x30BB;&#x30EB;&#x30D5;&#x30D7;&#x30ED;&#x30D3;&#x30B8;&#x30E7;&#x30CB;&#x30F3;&#x30B0;&#x3092;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3092;&#x8FFD;&#x52A0;&#x3057;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002; &#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x5834;&#x5408;&#x306B;&#x4E92;&#x63DB;&#x6027;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<ol>
<li><em>Project</em> &#x30C9;&#x30ED;&#x30C3;&#x30D7;&#x30C0;&#x30A6;&#x30F3;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306A;&#x3059;&#x3079;&#x3066;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002; <em>Create Project</em> &#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_create_project_developer_perspective.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<blockquote>
<p>NOTE:</p>
<p>&#x7570;&#x306A;&#x308B;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x305F;&#x7570;&#x306A;&#x308B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x6A29;&#x9650;&#x3068;&#x30AF;&#x30A9;&#x30FC;&#x30BF;&#x3092;&#x6301;&#x3064;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;</p>
</blockquote>
<ol>
<li><em>Name</em> &#x3092; <code>test</code> &#x3068;&#x3057;&#x3066;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<hr>
<h2 id="&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;">&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;</h2>
<p>Web &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E; Developer &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x3067;&#x306F;&#x3001;Add &#x30D3;&#x30E5;&#x30FC;&#x304B;&#x3089;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304A;&#x3088;&#x3073;&#x95A2;&#x9023;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x4F5C;&#x6210;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;OpenShift Container Platform &#x306B;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li>&#x4ECA;&#x56DE;&#x306E;&#x624B;&#x9806;&#x3067;&#x306F;&#x3001;Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x3067;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E; <em>Import from git</em> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002; </li>
<li>GitHub&#x306B;&#x3042;&#x308B;&#x65E2;&#x5B58;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;OpenShift Container Platform&#x4E0A;&#x3067;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3001;&#x69CB;&#x7BC9;&#x3001;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ul>
<h3 id="&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;">&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;</h3>
<ol>
<li>Add &#x30D3;&#x30E5;&#x30FC;&#x3067; From Git &#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3001;Import from Git &#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_add_application_from_git.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<ol>
<li>Git &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;&#x306B;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30B3;&#x30FC;&#x30C9;&#x30D9;&#x30FC;&#x30B9;&#x306E; Git &#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x30FC; URL &#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<pre><code>https://github.com/sclorg/nodejs-ex.git
</code></pre><p><img src="images/03_1_import_from_git_form_url.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<ol>
<li>``&#x3092;&#x9078;&#x629E;&#x3057;&#x3001;Builder &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3001;URL &#x306E;&#x691C;&#x8A3C;&#x5F8C;&#x306B;&#x3001;&#x9069;&#x5207;&#x306A;&#x30D3;&#x30EB;&#x30C0;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x304C;&#x691C;&#x51FA;&#x3055;&#x308C;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x9078;&#x629E;&#x3055;&#x308C;&#x307E;&#x3059;&#xFF08;&#x30B9;&#x30BF;&#x30FC;&#x306E;&#x30DE;&#x30FC;&#x30AF;&#x304C;&#x4ED8;&#x304D;&#x307E;&#x3059;&#xFF09;&#x3002;</li>
<li><p>&#x30D3;&#x30EB;&#x30C0;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x304C;&#x81EA;&#x52D5;&#x691C;&#x51FA;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x30D3;&#x30EB;&#x30C0;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;&#x5FC5;&#x8981;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x3001;Builder Image Version &#x306E;&#x30C9;&#x30ED;&#x30C3;&#x30D7;&#x30C0;&#x30A6;&#x30F3;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3092;&#x5909;&#x66F4;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>General &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3001;&#x4EE5;&#x4E0B;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><em>Application</em> &#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x30C9;&#x306B;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5206;&#x985E;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4E00;&#x610F;&#x306E;&#x540D;&#x524D; (nodejs-ex-app &#x306A;&#x3069;) &#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x540D;&#x304C; namespace &#x3067;&#x4E00;&#x610F;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li><em>Name</em> &#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x30C9;&#x306B;&#x3001;&#x3053;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x7528;&#x306B;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x3092;&#x5206;&#x985E;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4E00;&#x610F;&#x306A;&#x540D;&#x524D;&#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F; Git &#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x30FC; URL &#x3092;&#x30D9;&#x30FC;&#x30B9;&#x3068;&#x3057;&#x3066;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
</ol>
<ol>
<li><em>Resources</em> &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3001;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9; <em>Deployment</em> &#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059; </li>
<li>Deployment &#x306F;&#x5358;&#x7D14;&#x306A; Kubernetes&#x30B9;&#x30BF;&#x30A4;&#x30EB;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002; </li>
<li>&quot;Deployment Config&quot; &#x306F; OpenShift&#x30B9;&#x30BF;&#x30A4;&#x30EB;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002; </li>
<li>&quot;Knative Service&quot; &#x306F;&#x30DE;&#x30A4;&#x30AF;&#x30ED;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<blockquote>
<p>NOTE:</p>
<p>Knative Service &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x3001;Serverless Operator &#x304C;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x30FC;&#x306B;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x306B;&#x306E;&#x307F;&#x3001;Import from git &#x5F62;&#x5F0F;&#x3067;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</p>
</blockquote>
<ol>
<li>Advanced Options &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;Create a route to the application &#x304C;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x9078;&#x629E;&#x3055;&#x308C;&#x308B;&#x305F;&#x3081;&#x3001;&#x516C;&#x958B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B; URL &#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li><p>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D1;&#x30D6;&#x30EA;&#x30C3;&#x30AF;&#x30EB;&#x30FC;&#x30C8;&#x306B;&#x516C;&#x958B;&#x3057;&#x305F;&#x304F;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x3092;&#x30AF;&#x30EA;&#x30A2;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>Create &#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;Topology &#x30D3;&#x30E5;&#x30FC;&#x3067;&#x30D3;&#x30EB;&#x30C9;&#x306E;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
</ol>
<hr>
<h2 id="&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;-&#x305D;&#x306E;&#xFF12;-&#xFF08;&#x5B9F;&#x65BD;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#xFF09;">&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210; &#x305D;&#x306E;&#xFF12; &#xFF08;&#x5B9F;&#x65BD;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#xFF09;</h2>
<h3 id="&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;">&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;</h3>
<ol>
<li>&#x4EE5;&#x4E0B;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</li>
<li><p>GitHub &#x30EC;&#x30DD;&#x30B8;&#x30C8;&#x30EA; URL&#xFF1A;</p>
<pre><code>https://github.com/RedHatGov/openshift-workshops.git
</code></pre></li>
<li><p><em>&#x8A73;&#x7D30;&#x306E; Git &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8868;&#x793A;</em> &#x2192; <em>&#x30B3;&#x30F3;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x30FC;</em> &#x3092;&#x8A2D;&#x5B9A;&#xFF1A;</p>
<pre><code>/dc-metro-map
</code></pre></li>
<li><p>&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3057;&#x3066;&#x3001;<em>Route</em> &#x304B;&#x3089;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
</li>
</ol>
<p><img src="images/03_1_import_from_git_form_url.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<hr>
<h2 id="topology-&#x30D3;&#x30E5;&#x30FC;">Topology &#x30D3;&#x30E5;&#x30FC;</h2>
<p>Web &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;Developer&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306B;&#x3042;&#x308B;Topology&#x30D3;&#x30E5;&#x30FC;&#x3067;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x5185;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3001;&#x305D;&#x306E;&#x30D3;&#x30EB;&#x30C9;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x3001;&#x304A;&#x3088;&#x3073;&#x305D;&#x308C;&#x3089;&#x306B;&#x95A2;&#x9023;&#x3059;&#x308B;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x8996;&#x899A;&#x7684;&#x306B;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><img src="images/03_1_topology_view_a.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li>&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30AB;&#x30EB;&#x306A;&#x8868;&#x793A;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;Web &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x53F3;&#x4E0A;&#x306B;&#x3042;&#x308B;&#x300C;Topology&#x30D3;&#x30E5;&#x30FC;&#x300D;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_topology_view_switch_view.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<ol>
<li>Developer &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306E;&#x5DE6;&#x5074;&#x306E;&#x30CA;&#x30D3;&#x30B2;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30D1;&#x30CD;&#x30EB;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x3001;Topology &#x30D3;&#x30E5;&#x30FC;&#x306B;&#x79FB;&#x52D5;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x3089;&#x3001;Topology &#x30D3;&#x30E5;&#x30FC;&#x306B;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x3053;&#x3053;&#x3067;&#x306F;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3; Pod &#x306E;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x306E;&#x78BA;&#x8A8D;&#x3001;&#x30D1;&#x30D6;&#x30EA;&#x30C3;&#x30AF; URL &#x3067;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3078;&#x306E;&#x8FC5;&#x901F;&#x306A;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3001;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x3078;&#x306E;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3068;&#x305D;&#x306E;&#x5909;&#x66F4;&#x3001;&#x6700;&#x7D42;&#x30D3;&#x30EB;&#x30C9;&#x306E;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x306E;&#x78BA;&#x8A8D;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li>&#x30BA;&#x30FC;&#x30E0;&#x30A4;&#x30F3;&#x304A;&#x3088;&#x3073;&#x30BA;&#x30FC;&#x30E0;&#x30A2;&#x30A6;&#x30C8;&#x306B;&#x3088;&#x308A;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8A73;&#x7D30;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ol>
<ol>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x304C;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x306F; Pending &#x3068;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3059;&#x308B;&#x3068;&#x3001;Running&#x3068;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_topology_nodejs_pod_running.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ul>
<li>&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x3001;&#x7570;&#x306A;&#x308B;&#x30BF;&#x30A4;&#x30D7;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x30A4;&#x30F3;&#x30B8;&#x30B1;&#x30FC;&#x30BF;&#x30FC;&#x3068;&#x5171;&#x306B;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x540D;&#x304C;&#x8FFD;&#x52A0;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<ul>
<li><em>D</em>: Deployment</li>
<li><em>DC</em>: Deployment Configs</li>
<li><em>SS</em>: StatefulSet</li>
<li><em>DS</em>: Daemonset</li>
</ul>
</li>
</ul>
<blockquote>
<p>NOTE:</p>
<p>OpenShift Deployment Configs&#x306B;&#x52A0;&#x3048;&#x3066;&#x3001;Kubernetes <em>Deployments</em> &#x3082;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
</blockquote>
<hr>
<h2 id="monitoring-&#x30D3;&#x30E5;&#x30FC;&#x306E;&#x78BA;&#x8A8D;-openshift-monitoring">Monitoring &#x30D3;&#x30E5;&#x30FC;&#x306E;&#x78BA;&#x8A8D; (OpenShift Monitoring)</h2>
<p>Red Hat &#x306F;&#x6700;&#x8FD1;&#x3001;&#x30E2;&#x30CB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x6A5F;&#x80FD;&#x3092;&#x30A6;&#x30A7;&#x30D6;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x7D71;&#x5408;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x5168;&#x4F53;&#x306E;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3068;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3053;&#x3061;&#x3089;&#x3092;&#x3054;&#x89A7;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
<ol>
<li>&#x5DE6;&#x5074;&#x306E;&#x30D1;&#x30CD;&#x30EB;&#x3067; <em>Monitoring/&#x78BA;&#x8A8D;</em> &#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_1_developer_perspective_monitoring.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li><em>Dashboard</em> &#x30BF;&#x30D6;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3002;</li>
<li><p>Dashboard&#x30BF;&#x30D6;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x307E;&#x3068;&#x3081;&#x3066;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p><em>Metrics</em> &#x30BF;&#x30D6;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3002;</p>
</li>
<li><p>Metrics&#x30BF;&#x30D6;&#x306F;&#x3001;Prometheus Metrics&#x306E;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x30B0;&#x30E9;&#x30D5;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p><em>Events</em> &#x30BF;&#x30D6;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3002;</p>
</li>
<li>Events&#x30BF;&#x30D6;&#x306F;&#x3001;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x304C;&#x4E00;&#x3064;&#x306E;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x30E0;&#x3068;&#x3057;&#x3066;&#x8868;&#x793A;&#x3055;&#x308C;&#x3001;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30FC;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ol>
<hr>
<h2 id="pod-&#x306E;&#x78BA;&#x8A8D;-readiness-probe--liveness-probes">Pod &#x306E;&#x78BA;&#x8A8D; (Readiness Probe / Liveness Probes)</h2>
<p>Administrator &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x304B;&#x3089;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ol>
<li>&#x5DE6;&#x5074;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304B;&#x3089;&#x3001; <em>Workloads -&gt; Pods</em> &#x3092;&#x9078;&#x3073;&#x307E;&#x3059;</li>
<li><p>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E; <em>Pods</em> &#x30DA;&#x30FC;&#x30B8;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4E2D;&#x3067;&#x73FE;&#x5728;&#x5B9F;&#x884C;&#x4E2D;&#x306E;&#x5168;&#x3066;&#x306E;Pod&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li><code>Running</code>, <code>Pending</code> &#x306A;&#x3069;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x72B6;&#x614B;&#x3092;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li><em>Ready</em>  &#x5217;&#x306F; Readiness &#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x306B;&#x3082;&#x3068;&#x3065;&#x3044;&#x305F;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x5185;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x72B6;&#x614B;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
<li><p><code>openshift-workshops-git-XXXXX</code> Pod &#x3092;&#x30EA;&#x30B9;&#x30C8;&#x304B;&#x3089;&#x9078;&#x3073;&#x307E;&#x3059;&#x3002;</p>
</li>
<li>&#x305D;&#x308C;&#x305E;&#x308C;&#x306E; <em>Pod</em> &#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x4EE5;&#x4E0B;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<ul>
<li><em>&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;</em> &#x30BF;&#x30D6;</li>
</ul>
</li>
</ol>
<p><img src="images/03_1_admin_pod_details.png" alt="Memory Usage*, *CPU Usage*, *Filesystem* &#x306E;&#x30B0;&#x30E9;&#x30D5;"></p>
<div style="text-align: center;">Memory Usage*, *CPU Usage*, *Filesystem* &#x306E;&#x30B0;&#x30E9;&#x30D5;</div>

<ul>
<li><p>Pod&#x306E;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x3068;&#x305D;&#x308C;&#x3092;&#x30DB;&#x30B9;&#x30C8;&#x3059;&#x308B; OpenShift &#x30CE;&#x30FC;&#x30C9;</p>
<ul>
<li><em>Containers</em> &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x540D;&#x3068;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x72B6;&#x614B;&#x3092;&#x542B;&#x3080;&#x60C5;&#x5831;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;</li>
</ul>
</li>
<li><p><code>openshift-workshops-git</code> &#x3068;&#x3044;&#x3046;&#x540D;&#x524D;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066; <em>Container Details</em> &#x30DA;&#x30FC;&#x30B8;&#x3092;&#x958B;&#x304F;&#x3002;</p>
</li>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E; <em>Readiness Probe</em> &#x3068; <em>Liveness Probes</em> &#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li><p>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E; <em>Resource Requests</em> &#x3068; <em>Resource Limits</em> &#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>&#x305D;&#x306E;&#x307B;&#x304B;&#x3001;&#x5404;&#x30BF;&#x30D6;&#x3092;&#x898B;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p><em>Logs</em> &#x30BF;&#x30D6;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;</p>
<ul>
<li>Pod&#x306E;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x3053;&#x3053;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x3001;&#x66F4;&#x65B0;&#x3055;&#x308C;&#x308B;&#x306B;&#x3057;&#x305F;&#x304C;&#x3063;&#x3066;&#x8FFD;&#x8DE1;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li>&#x66F4;&#x65B0;&#x306B;&#x3088;&#x308B;&#x30ED;&#x30B0;&#x306E;&#x51FA;&#x529B;&#x3092;&#x4E00;&#x6642;&#x505C;&#x6B62;&#x304A;&#x3088;&#x3073;&#x518D;&#x958B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
<li><p><em>Terminal</em> &#x30BF;&#x30D6;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;</p>
<ul>
<li>&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3084;&#x30C6;&#x30B9;&#x30C8;&#x306E;&#x305F;&#x3081;&#x306B;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x5185;&#x3067;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
<li><p><em>Events</em> &#x30BF;&#x30D6;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;</p>
<ul>
<li>&#x3053;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306F;Pod&#x306E;Deployment&#x3067;&#x4F55;&#x304B;&#x304C;&#x304A;&#x304B;&#x3057;&#x3044;&#x304B;&#x3092;&#x63A2;&#x3057;&#x305F;&#x308A;&#x3001;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306E;&#x9023;&#x9396;&#x3092;&#x8FFD;&#x8DE1;&#x3057;&#x305F;&#x308A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x3048;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
</ul>
<hr>
<h2 id="operatorhub-&#x304B;&#x3089;-operator&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;">OperatorHub &#x304B;&#x3089; Operator&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;</h2>
<p>Administrator &#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x304B;&#x3089;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h3 id="openshift&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;">OpenShift&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;</h3>
<p>&#x4ED6;&#x306E;&#x30C7;&#x30E2;&#x30F3;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5B9F;&#x65BD;&#x3059;&#x308B;&#x524D;&#x306B;&#x3001; OpenShift Container Platform &#x306E; web&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x30DA;&#x30FC;&#x30B8;&#x3078;&#x884C;&#x304D;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x524A;&#x9664;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<ol>
<li>OpenShift&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;</li>
<li>&#x7BA1;&#x7406;&#x8005;&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306E;&#x4E0B;&#x306E;&#x5DE6;&#x5074;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304B;&#x3089;&#x3001;Operators &#x2192; OperatorHub&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x691C;&#x7D22;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x3067;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x691C;&#x7D22;&#x3057;&#x3001; OpenShiftPipelinesOperator&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_100_prerequisites_operatorhub.png" alt="OperatorHub"></p>
<div style="text-align: center;"></div>

<ol>
<li>&#x8AAC;&#x660E;&#x30D3;&#x30E5;&#x30FC;&#x3067;&#x3001;[&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x3059;&#x3079;&#x3066;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x8A2D;&#x5B9A;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_101_prerequisites_operatorhub_install_pipelines.png" alt="OperatorHub"></p>
<div style="text-align: center;"></div>

<ol>
<li>Update Channel&#x304C;stable&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001; Install&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;Operator&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3092;&#x958B;&#x59CB;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_102_prerequisites_operatorhub_install_operator.png" alt="OperatorHub"></p>
<div style="text-align: center;"></div>


<ol>
<li>&#x6570;&#x79D2;&#x5F8C;&#x3001;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x306F;&#x6B63;&#x5E38;&#x306B;&#x5B8C;&#x4E86;&#x3057;&#x3001;[&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;]&#x5217;&#x3067;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x3001;&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x304C;[&#x6210;&#x529F;]&#x3067;&#x3042;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x3092;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/03_103_prerequisites_operatorhub_pipelines_installed.png" alt="OperatorHub"></p>
<div style="text-align: center;"></div>

<h3 id="openshift-logging&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;">OpenShift logging&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;</h3>
<p>&#x540C;&#x69D8;&#x306E;&#x624B;&#x9806;&#x3067;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<h3 id="amq-streams&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;">AMQ Streams&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;</h3>
<p>&#x540C;&#x69D8;&#x306E;&#x624B;&#x9806;&#x3067;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../../" class="navigation navigation-prev " aria-label="Previous page: イントロダクション">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../04_Application_Deployment/chap-4.html" class="navigation navigation-next " aria-label="Next page: アプリケーションデプロイメント (s2i,Tekton)">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"OpenShift ユーザエクスペリエンス","level":"1.2","depth":1,"next":{"title":"アプリケーションデプロイメント (s2i,Tekton)","level":"1.3","depth":1,"path":"modules/04_Application_Deployment/chap-4.md","ref":"modules/04_Application_Deployment/chap-4.md","articles":[]},"previous":{"title":"イントロダクション","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"modules/03_OpenShift_User_Experience/chap-3.md","mtime":"2022-06-19T05:03:33.090Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-20T02:46:55.921Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

