
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>アプリケーションデプロイメント (s2i,Tekton) · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../03_OpenShift_User_Experience/chap-3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    イントロダクション
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../03_OpenShift_User_Experience/chap-3.html">
            
                <a href="../03_OpenShift_User_Experience/chap-3.html">
            
                    
                    OpenShift ユーザエクスペリエンス
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="chap-4.html">
            
                <a href="chap-4.html">
            
                    
                    アプリケーションデプロイメント (s2i,Tekton)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >アプリケーションデプロイメント (s2i,Tekton)</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;&#x57FA;&#x790E;s2itekton">&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;&#x57FA;&#x790E;(s2i,Tekton)</h1>
<p>&#x3053;&#x306E;&#x30E9;&#x30DC;&#x3067;&#x306F;&#x3001;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3068;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30E9;&#x30A4;&#x30D5;&#x30B5;&#x30A4;&#x30AF;&#x30EB;&#x3092;&#x51E6;&#x7406;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;OpenShift&#x3067;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x306B;&#x3064;&#x3044;&#x3066;&#x5B66;&#x7FD2;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li>OpenShift Pipelines&#x306F;&#x3001; Tekton&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x30CD;&#x30A4;&#x30C6;&#x30A3;&#x30D6;&#x306E;&#x7D99;&#x7D9A;&#x7684;&#x30A4;&#x30F3;&#x30C6;&#x30B0;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304A;&#x3088;&#x3073;&#x30C7;&#x30EA;&#x30D0;&#x30EA;&#x30FC;&#xFF08;CI / CD&#xFF09;&#x30BD;&#x30EA;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3059;&#x3002;</li>
<li>Tekton&#x306F;&#x3001;&#x67D4;&#x8EDF;&#x306A;Kubernetes&#x30CD;&#x30A4;&#x30C6;&#x30A3;&#x30D6;&#x306E;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;CI / CD&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3067;&#x3042;&#x308A;&#x3001;&#x57FA;&#x76E4;&#x3068;&#x306A;&#x308B;&#x8A73;&#x7D30;&#x3092;&#x62BD;&#x8C61;&#x5316;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x8907;&#x6570;&#x306E;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#xFF08;Kubernetes&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x30EC;&#x30B9;&#x3001;VM&#x306A;&#x3069;&#xFF09;&#x3078;&#x306E;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3092;&#x81EA;&#x52D5;&#x5316;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li>&#x7D99;&#x7D9A;&#x7684;&#x30C7;&#x30EA;&#x30D0;&#x30EA;&#x30FC;&#xFF08;CD&#xFF09;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306F;&#x3001;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3092;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x7BA1;&#x7406;&#x304B;&#x3089;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x3084;&#x9867;&#x5BA2;&#x306B;&#x76F4;&#x63A5;&#x5C4A;&#x3051;&#x308B;&#x305F;&#x3081;&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3092;&#x81EA;&#x52D5;&#x5316;&#x3057;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3078;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x5909;&#x66F4;&#xFF08;&#x30BD;&#x30FC;&#x30B9;&#x7BA1;&#x7406;&#x3067;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#xFF09;&#x306F;&#x3001;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x3055;&#x308C;&#x308B;&#x307E;&#x3067;&#x306B;&#x8907;&#x96D1;&#x306A;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3092;&#x7D4C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x306B;&#x306F;&#x3001;&#x4FE1;&#x983C;&#x6027;&#x304C;&#x9AD8;&#x304F;&#x53CD;&#x5FA9;&#x53EF;&#x80FD;&#x306A;&#x65B9;&#x6CD5;&#x3067;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3059;&#x308B;&#x3053;&#x3068;&#x3068;&#x3001;&#x30D3;&#x30EB;&#x30C9;&#x3055;&#x308C;&#x305F;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3092;&#x30C6;&#x30B9;&#x30C8;&#x3068;&#x5C55;&#x958B;&#x306E;&#x8907;&#x6570;&#x306E;&#x6BB5;&#x968E;&#x3067;&#x9032;&#x884C;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#xFF08;&#x300C;&#x30D3;&#x30EB;&#x30C9;&#x300D;&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#xFF09;&#x304C;&#x542B;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;</li>
</ul>
<hr>
<h2 id="java&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;">Java&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F5C;&#x6210;</h2>
<p>&#x3053;&#x306E;&#x30E9;&#x30DC;&#x306B;&#x306F;&#x72EC;&#x81EA;&#x306E;git&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001;&#x5358;&#x7D14;&#x306A;JavaS2I&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3067;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<ol>
<li>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4F5C;&#x6210;</li>
<li><p><em>Name</em> &#x3092; <code>workshop</code> &#x3068;&#x3057;&#x3066;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30D3;&#x30EB;&#x30C9;</p>
</li>
<li>&#x958B;&#x767A;&#x8005;&#x30D1;&#x30FC;&#x30B9;&#x30DA;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x3067;&#x3001;&#x5DE6;&#x5074;&#x306E;&#x30CA;&#x30D3;&#x30B2;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;[ +&#x8FFD;&#x52A0;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3001;[ Git&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;]&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3066;&#x3001;[ Git&#x304B;&#x3089;]&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_90_nationalparks-show-add-options.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ul>
<li><p>Import from Git&#x30EF;&#x30FC;&#x30AF;&#x30D5;&#x30ED;&#x30FC;&#x306F;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x9078;&#x629E;&#x306B;&#x57FA;&#x3065;&#x3044;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3059;&#x308B;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3092;&#x30AC;&#x30A4;&#x30C9;&#x3057;&#x307E;&#x3059;&#x3002;Git&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;URL&#x306B;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<pre><code>https://github.com/openshift-roadshow/nationalparks.git
</code></pre><blockquote>
<p>NOTE: </p>
<p>OpenShift&#x306F;&#x3001;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x3067;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;Git&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x30BF;&#x30A4;&#x30D7;&#x3068;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x8A00;&#x8A9E;&#x3092;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x63A8;&#x6E2C;&#x3057;&#x307E;&#x3059;&#x3002;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x6226;&#x7565;&#x3092;&#x9078;&#x629E;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x6C42;&#x3081;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;</p>
</blockquote>
</li>
<li><p>[&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x6226;&#x7565;&#x306E;&#x7DE8;&#x96C6;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#xFF08;3&#x3064;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#xFF09;&#x3001;[&#x30D3;&#x30EB;&#x30C9;&#x30A4;&#x30E1;&#x30FC;&#x30B8;]&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li>Devfile&#xFF1A;&#x3053;&#x308C;&#x306F;Devfilev2&#x4ED5;&#x69D8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;devfile.yaml&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;&#x306F;&#x3001;Devfilev2&#x5F62;&#x5F0F;&#x3067;&#x540D;&#x524D;&#x304C;&#x4ED8;&#x3051;&#x3089;&#x308C;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</li>
<li>Dockerfile&#xFF1A;&#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#x3001;&#x65E2;&#x5B58;&#x306E;Dockerfile&#x304B;&#x3089;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x304C;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</li>
<li>&#x30D3;&#x30EB;&#x30C0;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#xFF1A;&#x3053;&#x308C;&#x306F;&#x3001;Source-to-Image&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x30E1;&#x30AB;&#x30CB;&#x30BA;&#x30E0;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3001;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x304B;&#x3089;&#x76F4;&#x63A5;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
</ul>
<p><img src="images/04_91_nationalparks-import-strategy.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<p><img src="images/04_92_nationalparks-import-strategy-build.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ul>
<li><p>&#x30D3;&#x30EB;&#x30C0;&#x30FC;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3068;&#x3057;&#x3066;Java&#x304C;&#x9078;&#x629E;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001;OpenJDK11&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x306B;&#x306F;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; <em>openjdk-11-ubi8</em> &#x3092;&#x9078;&#x629E;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
</li>
<li><p>[&#x5168;&#x822C;]&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x307E;&#x3067;&#x4E0B;&#x306B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x540D; &#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;<pre><code>workshop
</code></pre></li>
<li><p>&#x540D;&#x524D; &#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<pre><code>nationalparks
</code></pre><p><img src="images/04_93_nationalparks-configure-service1.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>
</li>
<li><p><em>&#x8A73;&#x7D30;&#x306A;&#x30EB;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;</em> &#x3067; <em>&#x30BB;&#x30AD;&#x30E5;&#x30A2;&#x306A;&#x30EB;&#x30FC;&#x30C8;</em> &#x3092;&#x9078;&#x629E;&#x3002;<em>TLS &#x7D42;&#x7AEF;</em> &#x3092; <em>Edge</em> &#x306B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
</ul>
<p><img src="images/04_94_nationalparks-configure-service2.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<p><img src="images/04_95_nationalparks-configure-service3.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<ul>
<li><p>[&#x4F5C;&#x6210;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x9001;&#x4FE1;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>&#x30D3;&#x30EB;&#x30C9;&#x30ED;&#x30B0;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x30C8;&#x30DD;&#x30ED;&#x30B8;&#x30D3;&#x30E5;&#x30FC;&#x3067;nationalparks&#x30A8;&#x30F3;&#x30C8;&#x30EA;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3001;[&#x30EA;&#x30BD;&#x30FC;&#x30B9;]&#x30BF;&#x30D6;&#x306E;[&#x30D3;&#x30EB;&#x30C9;]&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;[&#x30ED;&#x30B0;&#x306E;&#x8868;&#x793A;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
</ul>
<p><img src="images/04_94_nationalparks-java-new-java-build.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x30D3;&#x30EB;&#x30C9;&#x304A;&#x3088;&#x3073;&#x4F9D;&#x5B58;&#x95A2;&#x4FC2;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3068;&#x3057;&#x3066;Maven&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;Java&#x30D9;&#x30FC;&#x30B9;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x305F;&#x3081;&#x3001;Maven&#x304C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x3059;&#x3079;&#x3066;&#x306E;&#x4F9D;&#x5B58;&#x95A2;&#x4FC2;&#x3092;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;&#x521D;&#x671F;&#x30D3;&#x30EB;&#x30C9;&#x306B;&#x306F;&#x6570;&#x5206;&#x304B;&#x304B;&#x308A;&#x307E;&#x3059;&#x3002;&#x3042;&#x306A;&#x305F;&#x306F;&#x3053;&#x308C;&#x3089;&#x3059;&#x3079;&#x3066;&#x304C;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x3067;&#x8D77;&#x3053;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#xFF01;</p>
<h3 id="&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x78BA;&#x8A8D;-&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;">&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x78BA;&#x8A8D; (&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;)</h3>
<ul>
<li>CLI&#x304B;&#x3089;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x3082;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
<pre><code>oc get builds
oc logs -f builds/nationalparks-1
oc get routes
</code></pre><blockquote>
<p>NOTE:</p>
<p>&#x3053;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3042;&#x308B;&#x305F;&#x3081;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x306F;Web&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30A4;&#x30B9;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<p>parksmap&#x30D5;&#x30ED;&#x30F3;&#x30C8;&#x30A8;&#x30F3;&#x30C9;&#x3068;&#x9023;&#x643A;&#x3059;&#x308B;&#x3059;&#x3079;&#x3066;&#x306E;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306F;&#x3001;/ws/info/&#x30A8;&#x30F3;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x3092;&#x5B9F;&#x88C5;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30C6;&#x30B9;&#x30C8;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x6B21;&#x306E;URL&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
</blockquote>
<p><img src="images/04_94_result.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<hr>
<h2 id="&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x4F7F;&#x3046;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;">&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x4F7F;&#x3046;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;</h2>
<p>OpenShift&#x306F;&#x3001;&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x30AF;&#x30EC;&#x30FC;&#x30E0;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4ECB;&#x3057;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x3044;&#x308B;&#x30DD;&#x30C3;&#x30C9;&#x306B;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x308B;&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x3092;&#x7BA1;&#x7406;&#x3057;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;Web&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304B;&#x3089;&#x7C21;&#x5358;&#x306B;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3082;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ol>
<li>&#x7BA1;&#x7406;&#x8005;&#x306E;&#x89B3;&#x70B9;&#x304B;&#x3089;&#x3001; [&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;] &#x2192; [&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x30AF;&#x30EC;&#x30FC;&#x30E0;]&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x53F3;&#x4E0A;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;[&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x30AF;&#x30EC;&#x30FC;&#x30E0;&#x306E;&#x4F5C;&#x6210;]&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x30AF;&#x30EC;&#x30FC;&#x30E0;&#x540D;&#x306E;&#x4E2D;&#x306B;app-source-pvc&#x3092;&#x633F;&#x5165;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>RWO&#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x30E2;&#x30FC;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x7528;&#x306B;1GiB&#x6C38;&#x7D9A;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;[&#x30B5;&#x30A4;&#x30BA;]&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306B;1&#x3092;&#x633F;&#x5165;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x4ED6;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x8A2D;&#x5B9A;&#x3092;&#x305D;&#x306E;&#x307E;&#x307E;&#x306B;&#x3057;&#x3066;&#x3001;[&#x4F5C;&#x6210;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_101_nationalparks-codechanges-pipeline-pvc.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<h2 id="tekton&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;">Tekton&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;</h2>
<p>&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306F;&#x914D;&#x4FE1;&#x30B5;&#x30A4;&#x30AF;&#x30EB;&#x306E;&#x3055;&#x307E;&#x3056;&#x307E;&#x306A;&#x6BB5;&#x968E;&#x9593;&#x3067;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D7;&#x30ED;&#x30E2;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x7D99;&#x7D9A;&#x7684;&#x30A4;&#x30F3;&#x30C6;&#x30B0;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3067;&#x3042;&#x308B;Tekton&#x306F;&#x3001;&#x7D99;&#x7D9A;&#x7684;&#x30A4;&#x30F3;&#x30C6;&#x30B0;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5F79;&#x5272;&#x3092;&#x6301;&#x3064;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3067;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306B;&#x306F;&#x3001;&#x914D;&#x4FE1;&#x30B5;&#x30A4;&#x30AF;&#x30EB;&#x306E;&#x3055;&#x307E;&#x3056;&#x307E;&#x306A;&#x6BB5;&#x968E;&#x3092;&#x30E2;&#x30C7;&#x30EB;&#x5316;&#x3059;&#x308B;&#x3059;&#x3079;&#x3066;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3068;&#x5BFE;&#x8A71;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x6A29;&#x9650;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3053;&#x306E;&#x4F8B;&#x3067;&#x306F;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x3042;&#x308B;&#x306E;&#x3068;&#x540C;&#x3058;GitHub&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306B;&#x683C;&#x7D0D;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3057;&#x307E;&#x3059;&#x3002;&#x3088;&#x308A;&#x73FE;&#x5B9F;&#x7684;&#x306A;&#x30B7;&#x30CA;&#x30EA;&#x30AA;&#x3067;&#x306F;&#x3001;&#x30A4;&#x30F3;&#x30D5;&#x30E9;&#x30B9;&#x30C8;&#x30E9;&#x30AF;&#x30C1;&#x30E3;&#x30FC;&#x3092;&#x30B3;&#x30FC;&#x30C9;&#x539F;&#x5247;&#x3068;&#x3057;&#x3066;&#x5C0A;&#x91CD;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3059;&#x3079;&#x3066;&#x306E;OpenShift&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x5B9A;&#x7FA9;&#x3068;&#x3068;&#x3082;&#x306B;&#x3059;&#x3079;&#x3066;&#x306E;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x5B9A;&#x7FA9;&#x3092;&#x4FDD;&#x5B58;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<ol>
<li><p>Nationalparks&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x7528;&#x306E;Tekton&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>&#x53F3;&#x4E0A;&#x306E; &#xFF0B; &#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;
<img src="images/04_100_add-tekton-pipelines.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>
</li>
<li><p>&#x4EE5;&#x4E0B;&#x306E; yaml &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x8CBC;&#x308A;&#x4ED8;&#x3051;&#x3057;&#x307E;&#x3059;&#x3002;
<img src="images/04_100_add-tekton-pipelines2.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

</li>
</ol>
<p>Pipeline&#x30EA;&#x30BD;&#x30FC;&#x30B9;</p>
<pre><code>apiVersion: tekton.dev/v1beta1
kind: Pipeline
metadata:
  name: nationalparks-pipeline
spec:
  params:
    - default: nationalparks
      name: APP_NAME
      type: string
    - default: &apos;https://github.com/openshift-roadshow/nationalparks.git&apos;
      description: The application git repository url
      name: APP_GIT_URL
      type: string
    - default: master
      description: The application git repository revision
      name: APP_GIT_REVISION
      type: string
  tasks:
    - name: git-clone
      params:
        - name: url
          value: $(params.APP_GIT_URL)
        - name: revision
          value: $(params.APP_GIT_REVISION)
        - name: submodules
          value: &apos;true&apos;
        - name: depth
          value: &apos;1&apos;
        - name: sslVerify
          value: &apos;true&apos;
        - name: deleteExisting
          value: &apos;true&apos;
        - name: verbose
          value: &apos;true&apos;
      taskRef:
        kind: ClusterTask
        name: git-clone
      workspaces:
        - name: output
          workspace: app-source
    - name: build-and-test
      params:
        - name: MAVEN_IMAGE
          value: gcr.io/cloud-builders/mvn
        - name: GOALS
          value:
            - package
        - name: PROXY_PROTOCOL
          value: http
      runAfter:
        - git-clone
      taskRef:
        kind: ClusterTask
        name: maven
      workspaces:
        - name: source
          workspace: app-source
        - name: maven-settings
          workspace: maven-settings
    - name: build-image
      params:
        - name: IMAGE
          value: image-registry.openshift-image-registry.svc:5000/$(context.pipelineRun.namespace)/$(params.APP_NAME):latest
        - name: BUILDER_IMAGE
          value: &gt;-
            registry.redhat.io/rhel8/buildah@sha256:82aa9592f3262313ec52f7a2335641e2581b0d0d9807980846d0539bb77d0657
        - name: STORAGE_DRIVER
          value: vfs
        - name: DOCKERFILE
          value: ./Dockerfile
        - name: CONTEXT
          value: .
        - name: TLSVERIFY
          value: &apos;true&apos;
        - name: FORMAT
          value: oci
      runAfter:
        - build-and-test
      taskRef:
        kind: ClusterTask
        name: buildah
      workspaces:
        - name: source
          workspace: app-source
    - name: redeploy
      params:
        - name: SCRIPT
          value: oc rollout restart deployment/$(params.APP_NAME)
      runAfter:
        - build-image
      taskRef:
        kind: ClusterTask
        name: openshift-client
  workspaces:
    - name: app-source
    - name: maven-settings
</code></pre><hr>
<h2 id="tekton-&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x5B9F;&#x884C;">Tekton &#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x5B9F;&#x884C;</h2>
<p>Pipeline&#x306F;&#x3001;CD&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5B9A;&#x7FA9;&#x30E2;&#x30C7;&#x30EB;&#x3067;&#x3059;&#x3002;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306F;&#x3001;&#x30D3;&#x30EB;&#x30C9;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x5168;&#x4F53;&#x3092;&#x5B9A;&#x7FA9;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306B;&#x306F;&#x901A;&#x5E38;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x3057;&#x3066;&#x304B;&#x3089;&#x914D;&#x4FE1;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30B9;&#x30C6;&#x30FC;&#x30B8;&#x304C;&#x542B;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;
Task&#x3068;ClusterTask&#x306B;&#x306F;&#x3001;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x30B9;&#x30C6;&#x30C3;&#x30D7;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;ClusterTasks&#x306F;&#x3001;OpenShift Pipelines&#x304C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x30FC;&#x5185;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x5229;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x3001;Tasks&#x306F;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li><p>&#x3053;&#x306E;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306B;&#x306F;&#x3001;&#x6B21;&#x306E;4&#x3064;&#x306E;&#x30BF;&#x30B9;&#x30AF;&#x304C;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li><p>git clone&#xFF1A;&#x3053;&#x308C;&#x306F;&#x3001;ClusterTask&#x56FD;&#x7ACB;&#x516C;&#x5712;&#x306E;&#x30BD;&#x30FC;&#x30B9;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x30AF;&#x30ED;&#x30FC;&#x30F3;&#x3092;Workspace app-source&#x4F5C;&#x6210;&#x3057;&#x3001;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;PVC&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x306B;&#x4FDD;&#x5B58;&#x3057;&#x307E;&#x3059;&#x3002;app-source-workspace</p>
</li>
<li><p>build-and-test&#xFF1A;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;Java&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x304A;&#x3088;&#x3073;&#x30C6;&#x30B9;&#x30C8;&#x3057;&#x307E;&#x3059;maven ClusterTask</p>
</li>
<li><p>build-image&#xFF1A;&#x3053;&#x308C;&#x306F;buildah ClusterTask&#x3067;&#x3042;&#x308A;&#x3001;OpenShift&#x306E;&#x5165;&#x529B;&#x3068;&#x3057;&#x3066;&#x30D0;&#x30A4;&#x30CA;&#x30EA;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF08;&#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x524D;&#x306E;&#x30BF;&#x30B9;&#x30AF;&#x3067;&#x751F;&#x6210;&#x3055;&#x308C;&#x305F;JAR&#x30A2;&#x30FC;&#x30C6;&#x30A3;&#x30D5;&#x30A1;&#x30AF;&#x30C8;&#xFF09;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>redeploy&#xFF1A; ClusterTask&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3001;&#x524D;&#x306E;&#x30E9;&#x30DC;&#x3067;&#x4F5C;&#x6210;&#x3057;&#x305F;openshift-client&#x540D;&#x524D;&#x306E;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3001;OpenShift&#x306B;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3057;&#x307E;&#x3059;&#x3002;nationalparks</p>
</li>
</ul>
</li>
</ul>
<ol>
<li>&#x5DE6;&#x5074;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304B;&#x3089;[&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3001;&#x6B21;&#x306B;[ nationalparks-pipeline ]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_100_devops-pipeline-created.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>


<ul>
<li><p>&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306F;&#x8907;&#x6570;&#x306E;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x304C;&#x3042;&#x308A;&#x3001;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306E;&#x3042;&#x308B;&#x3082;&#x306E;&#x306B;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x5024;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;2&#x3064;&#x306E;&#x30EF;&#x30FC;&#x30AF;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#xFF1A;</p>
<ul>
<li>app-source &#xFF1A;&#x4EE5;&#x524D;&#x306B;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;PersistentVolumeClaim &#x306B;&#x30EA;&#x30F3;&#x30AF;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x5225;&#x306E;&#x30BF;&#x30B9;&#x30AF;app-source-pvc&#x3067;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x30A2;&#x30FC;&#x30C6;&#x30A3;&#x30D5;&#x30A1;&#x30AF;&#x30C8;&#x3092;&#x4FDD;&#x5B58;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;</li>
<li>maven-settings&#xFF1A; Maven&#x30AD;&#x30E3;&#x30C3;&#x30B7;&#x30E5;&#x7528;&#x306E;EmptyDir&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30E0;&#x3002;&#x3053;&#x308C;&#x3092;PVC&#x3067;&#x62E1;&#x5F35;&#x3057;&#x3066;&#x3001;&#x5F8C;&#x7D9A;&#x306E;Maven&#x30D3;&#x30EB;&#x30C9;&#x3092;&#x9AD8;&#x901F;&#x5316;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
</li>
<li><p>Developer Perspective&#x5185;&#x3067;&#x3001;&#x5DE6;&#x5074;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;[ Pipeline ]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x304B;&#x3089;&#x3001; nationalparks-pipeline&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
<li>&#x53F3;&#x4E0A;&#x306E;[&#x30A2;&#x30AF;&#x30B7;&#x30E7;&#x30F3;]&#x30EA;&#x30B9;&#x30C8;&#x304B;&#x3089;&#x3001;[&#x958B;&#x59CB;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ul>
<p><img src="images/04_102_devops-pipeline-start-1.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li>&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li><p>&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x8FFD;&#x52A0;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x3001;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x3082;&#x306E;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</p>
</li>
<li><p>APP_GIT_URL&#x3067;nationalparks&#x3001; GitHub&#x304B;&#x3089;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</li>
</ol>
<pre><code>https://github.com/openshift-roadshow/nationalparks.git
</code></pre><ul>
<li>&#x30EF;&#x30FC;&#x30AF;&#x30B9;&#x30DA;&#x30FC;&#x30B9; &#x2192; app-source&#x3067;&#x3001;&#x30EA;&#x30B9;&#x30C8;&#x304B;&#x3089;PVC&#x3092;&#x9078;&#x629E;&#x3057;&#x3001;&#x6B21;&#x306B;app-source-pvc&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>[&#x958B;&#x59CB;]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ul>
<p><img src="images/04_103_devops-pipeline-start-2.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<h2 id="&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x78BA;&#x8A8D;">&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x78BA;&#x8A8D;</h2>
<ol>
<li>Web&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304B;&#x3089;&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x5B9F;&#x884C;&#x3092;&#x7C21;&#x5358;&#x306B;&#x8FFD;&#x8DE1;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
<li>Developer Perspective&#x3092;&#x958B;&#x304D;&#x3001;&#x5DE6;&#x5074;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;[ Pipeline ]&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x304B;&#x3089;&#x3001; nationalparks-pipeline&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>[&#x30D1;&#x30A4;&#x30D7;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x5B9F;&#x884C;]&#x30BF;&#x30D6;&#x306B;&#x5207;&#x308A;&#x66FF;&#x3048;&#x3066;&#x3001;&#x9032;&#x884C;&#x4E2D;&#x306E;&#x3059;&#x3079;&#x3066;&#x306E;&#x30B9;&#x30C6;&#x30C3;&#x30D7;&#x3092;&#x76E3;&#x8996;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_104_devops-pipeline-run-1.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li>PipelineRun National-parks-deploy-run-&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_105_devops-pipeline-run-java-2.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li>&#x6B21;&#x306B;&#x3001;&#x5B9F;&#x884C;&#x4E2D;&#x306E;&#x30BF;&#x30B9;&#x30AF;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x30ED;&#x30B0;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_106_devops-pipeline-run-java-3.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<ol>
<li>PipelineRun&#x304C;&#x6B63;&#x5E38;&#x306B;&#x5B8C;&#x4E86;&#x3057;&#x305F;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;</li>
</ol>
<p><img src="images/04_107_devops-pipeline-run-java-4.png" alt="Project&#x4F5C;&#x6210;"></p>
<div style="text-align: center;"></div>

<hr>
<h2 id="&#x8FFD;&#x52A0;&#x306E;&#x30C7;&#x30E2;-&#xFF08;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#xFF09;">&#x8FFD;&#x52A0;&#x306E;&#x30C7;&#x30E2; &#xFF08;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#xFF09;</h2>
<p>OpenShift&#x3067;&#x306F;BuildConfig&#x3092;&#x5B9A;&#x7FA9;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;Source-2-Image&#x3068;&#x3044;&#x3046;&#x4ED5;&#x7D44;&#x307F;&#x304C;&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x306B;&#x52A0;&#x3048;&#x3066;&#x3001;Webhooks&#x306A;&#x3069;BuildConfig&#x3092;&#x5B9F;&#x884C;&#x3059;&#x3079;&#x304D;&#x72B6;&#x6CC1;&#x3092;&#x5236;&#x5FA1;&#x3059;&#x308B;&#x30C8;&#x30EA;&#x30AC;&#x30FC;&#x3082;&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li>OpenShift&#x306F;&#x3001;&#x30D3;&#x30EB;&#x30C9;&#x3092;&#x30C8;&#x30EA;&#x30AC;&#x30FC;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304B;&#x3089;&#x30D5;&#x30C3;&#x30AF;&#x3092;&#x53D7;&#x4FE1;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;API&#x30A8;&#x30F3;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;</li>
<li>&#x30B3;&#x30FC;&#x30C9;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x306E;&#x30D5;&#x30C3;&#x30AF;&#x3092;OpenShift&#x306E;API&#x306B;&#x5411;&#x3051;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30B3;&#x30FC;&#x30C9;/&#x30D3;&#x30EB;&#x30C9;/&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x306E;&#x81EA;&#x52D5;&#x5316;&#x3092;&#x5B9F;&#x73FE;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
<p>&#x8A73;&#x7D30;&#x306A;&#x30B9;&#x30C6;&#x30C3;&#x30D7;&#x306F; <a href="https://redhat-scholars.github.io/openshift-starter-guides/rhs-openshift-starter-guides/4.9/nationalparks-java-codechanges-github.html" target="_blank">&#x3053;&#x3061;&#x3089;</a> &#x3092;&#x53C2;&#x8003;&#x306B;&#x5B9F;&#x65BD;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../03_OpenShift_User_Experience/chap-3.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: OpenShift ユーザエクスペリエンス">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"アプリケーションデプロイメント (s2i,Tekton)","level":"1.3","depth":1,"previous":{"title":"OpenShift ユーザエクスペリエンス","level":"1.2","depth":1,"path":"modules/03_OpenShift_User_Experience/chap-3.md","ref":"modules/03_OpenShift_User_Experience/chap-3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"modules/04_Application_Deployment/chap-4.md","mtime":"2022-06-19T05:03:46.402Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-20T02:46:55.921Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

